app/services/natural_language_parsing_service.rb

INSERT INTO "natural_language_instructions" ("seating_event_id", "instruction_text", "parsing_status", "parsed_rules", "ai_interpretation", "confidence_score", "created_by_id", "error_message", "created_at", "updated_at") VALUES (2, 'Keep all FBI agents at different tables', 'pending', '[]', '{}', 0.0, 1, NULL, '2025-09-04 19:14:41.082396', '2025-09-04 19:14:41.082396') RETURNING "id"
---
    def parse_instruction(instruction_text, seating_event, user)
      # Create the NaturalLanguageInstruction record
      nl_instruction = NaturalLanguageInstruction.create!(
        seating_event: seating_event,
        instruction_text: instruction_text,
        created_by: user,
        parsing_status: 'pending'
      )

SELECT "students".* FROM "students" WHERE "students"."cohort_id" = 1 LIMIT 100
SELECT COUNT(*) FROM "students" WHERE "students"."cohort_id" = 1
---
    def get_cohort_attributes(cohort)
      students = cohort.students.limit(100) # Sample for attribute discovery

      # Get available custom attributes
      custom_attrs = students.map { |s| s.student_attributes&.keys || [] }.flatten.uniq

      # Get available inference fields
      inference_fields = students.map { |s| s.inferences&.keys || [] }.flatten.uniq

      # Get sample values for each field
      attribute_info = {}

      (custom_attrs + inference_fields).uniq.each do |field|
        values = students.map do |s|
          s.get_attribute(field) || s.get_inference_value(field)
        end.compact.uniq.first(10)

        attribute_info[field] = values if values.any?
      end

      {
        total_students: cohort.students.count,
        attributes: attribute_info,
        common_fields: %w[organization location title gender agency_level department_type seniority_level]

INSERT INTO "seating_rules" ("seating_event_id", "rule_type", "natural_language_input", "parsed_rule", "confidence_score", "target_attributes", "constraints", "priority", "active", "created_at", "updated_at") VALUES (2, 'separation', 'Keep all FBI agents at different tables', '{"rule_type":"separation","description":"Ensure no table has more than one attendee from the FBI; all FBI agents must be seated at different tables.","target_attributes":{"organization":["FBI"]},"constraints":{"min_distance":1,"max_per_table":1,"custom_logic":"Attendees with organization=FBI must be assigned to distinct tables (no two FBI agents at the same table)."},"priority":1}', 0.96, '{"organization":["FBI"]}', '{"min_distance":1,"max_per_table":1,"custom_logic":"Attendees with organization=FBI must be assigned to distinct tables (no two FBI agents at the same table)."}', 1, TRUE, '2025-09-04 19:15:01.258608', '2025-09-04 19:15:01.258608') RETURNING "id"
---
    def create_seating_rules(parsing_result, seating_event, nl_instruction)
      rules = []

      parsing_result['rules'].each_with_index do |rule_data, index|
        rule = SeatingRule.create!(
          seating_event: seating_event,
          rule_type: rule_data['rule_type'],
          natural_language_input: nl_instruction.instruction_text,
          parsed_rule: rule_data,
          confidence_score: parsing_result['confidence'].to_f,
          target_attributes: rule_data['target_attributes'] || {},
          constraints: rule_data['constraints'] || {},
          priority: rule_data['priority'] || (index + 1),
          active: true
        )