app/services/openai_service.rb

    def get_active_configuration
      @active_config ||= AiConfiguration.find_by(active: true)
---
SELECT "ai_configurations".* FROM "ai_configurations" WHERE "ai_configurations"."active" = TRUE LIMIT 1

    def track_cost(user:, request_id:, model:, response:, purpose:, config:)
      return unless user

      usage = response.dig("usage")
      return unless usage

      input_tokens = usage["prompt_tokens"] || 0
      output_tokens = usage["completion_tokens"] || 0

      # Calculate cost based on configuration
      cost_estimate = calculate_cost(input_tokens, output_tokens, config)

      CostTracking.create!(
        user: user,
        request_id: request_id,
        ai_model_used: model,
        input_tokens: input_tokens,
        output_tokens: output_tokens,
        cost_estimate: cost_estimate,
        purpose: purpose
      )
---
INSERT INTO "cost_trackings" ("user_id", "request_id", "ai_model_used", "input_tokens", "output_tokens", "cost_estimate", "purpose", "created_at", "updated_at") VALUES (1, 'openai_016665edaf85d9e7', 'gpt-5', 586, 927, 0.03026, 'cohort_metadata_extraction', '2025-09-04 22:24:29.096972', '2025-09-04 22:24:29.096972') RETURNING "id"