app/services/rule_validation_service.rb

SELECT COUNT(*) FROM "students" WHERE "students"."cohort_id" = 1
---
    def check_feasibility(rules, seating_event)
      cohort = seating_event.cohort
      total_students = cohort.students.count

SELECT COUNT(*) FROM "students" WHERE "students"."cohort_id" = 1
---
    def calculate_expected_utilization(rules, seating_event)
      # Simple utilization calculation
      total_capacity = seating_event.table_size * seating_event.total_tables
      actual_students = seating_event.cohort.students.count

SELECT "students".* FROM "students" WHERE "students"."cohort_id" = 1
---
    def count_affected_students(rule, cohort)
      return cohort.students.count if rule.target_attributes.blank?

      count = 0
      cohort.students.each do |student|