app/views/dashboard/index.html.erb

SELECT "seating_events".* FROM "seating_events" WHERE "seating_events"."cohort_id" = 2
SELECT COUNT(*) FROM "seating_events" WHERE "seating_events"."cohort_id" = 2
---
                    <span class="text-sm text-gray-600">
                      <span class="font-medium"><%= cohort.seating_events.count %></span> events