lib/tasks/phase2_test.rake

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "role", "first_name", "last_name", "created_at", "updated_at") VALUES ('test@chds.edu', '$2a$12$/cQo4TYU7MRS9anq5QXB6erUdbF7jsqvEcBPlkeq12iZtHEOR7qAW', NULL, NULL, NULL, 0, NULL, NULL, '2025-09-04 18:23:24.631326', '2025-09-04 18:23:24.631326') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@chds.edu' LIMIT 1
SELECT "ai_configurations".* FROM "ai_configurations" WHERE "ai_configurations"."ai_model_name" = 'gpt-4o-mini' LIMIT 1
---
  task test: :environment do
    puts "🚀 Starting Phase 2 Test Suite..."

    begin
      # Step 1: Create test user
      puts "\n1. Creating test user..."
      test_user = User.find_or_create_by(email: 'test@chds.edu') do |user|
        user.password = 'password123'
        user.password_confirmation = 'password123'
      end
      puts "✅ Test user created/found: #{test_user.email}"

      # Step 2: Create AI configuration
      puts "\n2. Creating AI configuration..."
      ai_config = AiConfiguration.find_or_create_by(ai_model_name: 'gpt-4o-mini') do |config|

SELECT "cohorts".* FROM "cohorts" ORDER BY "cohorts"."id" ASC LIMIT 1
---

      # Step 4: Use existing cohort or create test cohort
      puts "\n4. Finding test cohort..."
      test_cohort = Cohort.first

SELECT "students".* FROM "students" WHERE "students"."name" = 'John Smith' AND "students"."cohort_id" = 1 LIMIT 1
INSERT INTO "students" ("name", "title", "organization", "location", "cohort_id", "student_attributes", "inferences", "confidence_scores", "created_at", "updated_at") VALUES ('John Smith', 'Supervisory Special Agent', 'FBI', 'Washington, DC', 1, NULL, NULL, NULL, '2025-09-04 18:25:03.632671', '2025-09-04 18:25:03.632671') RETURNING "id"
---
        ]

        sample_students.each do |student_data|
          student = Student.find_by(name: student_data[:name], cohort_id: test_cohort.id)
          unless student
            student = Student.create!(
              cohort_id: test_cohort.id,
              name: student_data[:name],
              title: student_data[:title],
              organization: student_data[:organization],
              location: student_data[:location]
            )

SELECT 1 AS one FROM "students" WHERE "students"."cohort_id" = 1 LIMIT 1
---
      puts "\n6. Testing attribute inference..."
      students = test_cohort.students.limit(3)

      if students.any?

SELECT SUM("cost_trackings"."cost_estimate") FROM "cost_trackings"
SELECT COUNT(*) FROM "cost_trackings"
---

      # Step 7: Check cost tracking
      puts "\n7. Checking cost tracking..."
      total_cost = CostTracking.sum(:cost_estimate)
      total_requests = CostTracking.count

SELECT COUNT(*) FROM "ai_configurations" WHERE "ai_configurations"."active" = TRUE
SELECT COUNT(*) FROM "students" WHERE "students"."cohort_id" = 1
SELECT COUNT(*) FROM "cost_trackings"
---
      puts "\n🎉 Phase 2 Test Suite Completed!"
      puts "\n📊 Summary:"
      puts "   ✅ OpenAI Service: #{OpenaiService.configured? ? 'Configured' : 'Not configured'}"
      puts "   ✅ AI Configurations: #{AiConfiguration.count} (Active: #{AiConfiguration.active.count})"
      puts "   ✅ Test Cohort: #{test_cohort.name}"
      puts "   ✅ Sample Students: #{test_cohort.students.count}"
      puts "   ✅ Cost Records: #{CostTracking.count}"

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@chds.edu' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 4
---
  task clean: :environment do
    puts "🧹 Cleaning up test data..."

    # Clean up only test students, not the whole cohort
    test_students = Student.where(name: ['John Smith', 'Sarah Johnson', 'Michael Davis', 'John Test'])
    if test_students.any?
      test_students.destroy_all
      puts "✅ Test students cleaned up"
    end

    test_user = User.find_by(email: 'test@chds.edu')
    if test_user
      test_user.destroy