app/views/cohorts/show.html.erb

      <div class="flex space-x-3">
        <% if @cohort.students.any? %>
---
SELECT 1 AS one FROM "students" WHERE "students"."cohort_id" = 2 LIMIT 1

            </div>
            <% elsif @cohort.students.any? %>
---
SELECT 1 AS one FROM "students" WHERE "students"."cohort_id" = 2 LIMIT 1