app/controllers/cohorts_controller.rb

  def create
    @cohort = current_user.cohorts.build(cohort_params)

    if @cohort.save
---
INSERT INTO "cohorts" ("name", "description", "start_date", "end_date", "user_id", "max_students", "created_at", "updated_at") VALUES ('Emergence 2501 Cohort', 'Emergence program cohort roster (Cohort 2501)', '2025-09-14', '2025-09-19', 1, 25, '2025-09-04 22:49:38.591927', '2025-09-04 22:49:38.591927') RETURNING "id"

  def set_cohort
    @cohort = current_user.cohorts.find(params[:id])
---
SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."user_id" = 1 AND "cohorts"."id" = 2 LIMIT 1