app/controllers/cohorts_controller.rb

  def set_cohort
    @cohort = current_user.cohorts.find(params[:id])
---
SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."user_id" = 1 AND "cohorts"."id" = 2 LIMIT 1