app/controllers/dashboard_controller.rb

SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."user_id" = 1
SELECT "seating_events".* FROM "seating_events" WHERE "seating_events"."cohort_id" = 2
SELECT "students".* FROM "students" WHERE "students"."cohort_id" = 2
SELECT COUNT(*) FROM "students" INNER JOIN "cohorts" ON "cohorts"."id" = "students"."cohort_id" WHERE "cohorts"."user_id" = 1
SELECT COUNT(*) FROM "seating_events" WHERE "seating_events"."cohort_id" = 2
SELECT COUNT(*) FROM "students" WHERE "students"."cohort_id" = 2
SELECT COUNT(*) FROM "cohorts" WHERE "cohorts"."user_id" = 1 AND (start_date <= '2025-09-04' AND end_date >= '2025-09-04')
---
  def index
    @cohorts = current_user.cohorts.includes(:students, :seating_events)
    @recent_imports = current_user.import_sessions.recent.limit(5)
    @total_students = Student.joins(:cohort).where(cohorts: { user: current_user }).count
    @active_cohorts = @cohorts.active.count