app/controllers/imports_controller.rb

  def set_cohort
    @cohort = Cohort.find(params[:cohort_id])
---
SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = 2 LIMIT 1