app/models/ai_configuration.rb

  def only_one_active_configuration
    if active? && AiConfiguration.where(active: true).where.not(id: id).exists?
---
SELECT 1 AS one FROM "ai_configurations" WHERE "ai_configurations"."active" = TRUE AND "ai_configurations"."id" IS NOT NULL LIMIT 1

  def deactivate_others_if_active
    if active_changed? && active?
      AiConfiguration.where.not(id: id).update_all(active: false)
---
UPDATE "ai_configurations" SET "active" = FALSE WHERE "ai_configurations"."id" IS NOT NULL